Artillery/Playwright-perf-tests/airbnb-playwright-perf-test.yml
config:
  target: https://www.airbnb.com/
  phases:
    - duration: 30
      arrivalCount: 1
#      rampTo: 5
      name: Warm up phase
  engines:
    playwright:
      extendedMetrics: true
      launchOptions:
        headless: true
  processor: "./reserve-listing.js"
scenarios:
  - engine: playwright
    testFunction: "reserveListingFlow"